package org.home.assignment4;


//Задача
//Реализовать программу для работы с графическими 2D фигурами (Квадрат, Прямоугольник, Круг  и Треугольник).
//Пользователю предоставить меню, для выбора фигуры.
//Выберите фигуру:
//Квадрат
//Прямоугольник
//Круг
//Треугольник
//Выход
//После выбора конкретной фигуры запросить определяющие ее параметры (ширина, высота - для прямоугольника,
// стороны для треугольника, радиус для круга).
//Вы выбрали прямоугольник.
//	Введите длину боковой грани: 10
//Введите длину верхней грани: 20
//Для каждой фигуры реализовать отдельными методами расчет площади и периметра, и вывести их на экран.
//Прямоугольник со сторонами 10, 20 имеет площадь 200.
//
//Каждую фигуру оформить в виде отдельного класса.
//Каждый класс должен переопределить метод toString - описание фигуры с определяющими ее параметрами
//Создать отдельный класс создающий конкретную фигуру по выбору пользователя. Этот же класс должен производить
// взаимодействие с пользователем по зарпашиванию параметров фигуры.
public class Home {
}
